name: "face_lm"
layer {
  name: "face_lm"
  type: "Data"
  top: "image_data"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "examples/face_lm/image_mean.binaryproto"
    scale: 0.00390625
  }
  data_param {
    source: "examples/face_lm/face_image_train_small_lmdb"
    batch_size: 256
    backend: LMDB
  }
}
layer {
  name: "face_lm"
  type: "Data"
  top: "landmark_data"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "examples/face_lm/landmark_mean.binaryproto"
    scale: 0.003
  }
  data_param {
    source: "examples/face_lm/face_lm_train_small_lmdb"
    batch_size: 256
    backend: LMDB
  }
}
layer {
  name: "face_lm"
  type: "Data"
  top: "image_data"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "examples/face_lm/image_mean.binaryproto"
    scale: 0.00390625
  }
  data_param {
    source: "examples/face_lm/face_image_test_small_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "face_lm"
  type: "Data"
  top: "landmark_data"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "examples/face_lm/landmark_mean.binaryproto"
    scale: 0.003
  }
  data_param {
    source: "examples/face_lm/face_lm_test_small_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "image_data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    kernel_size: 16
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 2
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "conv5"
  top: "ip1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 132
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "val_loss"
  type: "EuclideanLoss"
  bottom: "ip1"
  bottom: "landmark_data"
  top: "val_loss"
  include {
    phase: TEST
  }
}
layer {
  name: "train_loss"
  type: "EuclideanLoss"
  bottom: "ip1"
  bottom: "landmark_data"
  top: "train_loss"
  include {
    phase: TRAIN
  }
}
